-- MySQL dump 10.13  Distrib 8.0.27, for Linux (x86_64)
--
-- Host: localhost    Database: topic_channel_platform
-- ------------------------------------------------------
-- Server version	8.0.27

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `administrator`
--

DROP TABLE IF EXISTS `administrator`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `administrator` (
  `user_id` varchar(255) NOT NULL,
  `user_password` varchar(255) NOT NULL,
  PRIMARY KEY (`user_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `administrator`
--

LOCK TABLES `administrator` WRITE;
/*!40000 ALTER TABLE `administrator` DISABLE KEYS */;
INSERT INTO `administrator` VALUES ('admin','$2a$10$glBdj3xW2ts.i12oHxuxAORRAAxJY9j0Gbndb07S63ADH8KscZTn6');
/*!40000 ALTER TABLE `administrator` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `collect`
--

DROP TABLE IF EXISTS `collect`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `collect` (
  `collect_time` datetime(6) DEFAULT NULL,
  `theme_post_id` bigint NOT NULL,
  `user_id` varchar(255) NOT NULL,
  PRIMARY KEY (`theme_post_id`,`user_id`),
  KEY `FKmrirw90e46c996n8gmrvj3aw8` (`user_id`),
  CONSTRAINT `FK777v1vqc84o05sst5oq946rh4` FOREIGN KEY (`theme_post_id`) REFERENCES `theme_post` (`theme_post_id`),
  CONSTRAINT `FKmrirw90e46c996n8gmrvj3aw8` FOREIGN KEY (`user_id`) REFERENCES `ordinary_user` (`user_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `collect`
--

LOCK TABLES `collect` WRITE;
/*!40000 ALTER TABLE `collect` DISABLE KEYS */;
INSERT INTO `collect` VALUES ('2026-05-24 21:47:07.316141',1,'765390751'),('2026-05-23 18:06:09.692392',3,'193721180'),('2026-05-23 17:55:19.076451',3,'437346159'),('2026-05-23 18:06:06.493337',4,'193721180'),('2026-05-23 18:06:07.451983',5,'193721180'),('2026-05-23 21:50:40.586318',7,'437346159'),('2026-05-25 11:17:12.270941',120,'193721180'),('2026-05-25 11:16:58.579950',120,'993063755');
/*!40000 ALTER TABLE `collect` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `comment`
--

DROP TABLE IF EXISTS `comment`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `comment` (
  `comment_id` bigint NOT NULL AUTO_INCREMENT,
  `audit_state` varchar(255) DEFAULT NULL,
  `content` text,
  `publish_time` datetime(6) DEFAULT NULL,
  `user_id` varchar(255) NOT NULL,
  `theme_post_id` bigint NOT NULL,
  PRIMARY KEY (`comment_id`),
  KEY `FKb6r8n8lv21jqeai96r9dj5ava` (`user_id`),
  KEY `FKpiexdf36evxstjaubhnd9lxp1` (`theme_post_id`),
  CONSTRAINT `FKb6r8n8lv21jqeai96r9dj5ava` FOREIGN KEY (`user_id`) REFERENCES `ordinary_user` (`user_id`),
  CONSTRAINT `FKpiexdf36evxstjaubhnd9lxp1` FOREIGN KEY (`theme_post_id`) REFERENCES `theme_post` (`theme_post_id`)
) ENGINE=InnoDB AUTO_INCREMENT=252 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `comment`
--

LOCK TABLES `comment` WRITE;
/*!40000 ALTER TABLE `comment` DISABLE KEYS */;
INSERT INTO `comment` VALUES (1,'审核通过','抢沙发','2026-05-23 17:41:01.482799','193721180',1),(2,'审核通过','抢板凳','2026-05-23 17:41:06.081603','193721180',1),(3,'审核通过','楼主好坏','2026-05-23 17:41:16.153690','193721180',1),(4,'审核通过','好东西喜欢做得好','2026-05-23 17:51:04.909758','246619214',2),(5,'审核通过','喜欢😍','2026-05-23 17:51:24.211095','246619214',2),(6,'审核通过','➕3','2026-05-23 17:51:42.293747','246619214',1),(7,'审核通过','111','2026-05-23 17:52:27.795058','437346159',3),(8,'审核通过','经过随机摇号，让我们恭喜一楼获得大奖：阿米娅1：7手办*0；\n恭喜第01楼获得随机通行证*00','2026-05-23 17:54:48.000933','437346159',3),(9,'审核通过','+3','2026-05-23 18:00:22.630503','437346159',1),(10,'审核通过','dd','2026-05-23 18:09:20.470505','063119958',3),(11,'审核通过','六六六','2026-05-23 18:27:31.065232','437346159',3),(13,'审核通过','官方忘记切号了吧🤡🤡🤡','2026-05-23 18:28:21.673617','437346159',3),(14,'审核通过','星极小姐驾到，统统闪开','2026-05-23 18:48:45.421122','797754129',3),(15,'审核通过','我只剩一根手指能动了，我可以玩维什戴尔吗','2026-05-23 18:49:38.889185','797754129',3),(16,'审核通过','你是星极小姐吗就参观😠','2026-05-23 18:49:54.352533','193721180',8),(17,'审核通过','关注明日方舟_official','2026-05-23 21:24:32.667107','437346159',8),(18,'审核通过','有的有的','2026-05-23 21:25:36.380236','246619214',5),(19,'审核通过','man waht acn i sya','2026-05-23 21:25:56.726401','246619214',4),(20,'审核通过','喜欢','2026-05-23 21:26:21.140840','246619214',8),(21,'审核通过','300抽怎么输？😃','2026-05-23 21:26:45.271755','246619214',7),(22,'审核通过','快写完了','2026-05-23 21:26:58.741130','246619214',9),(23,'审核通过','哪来的明日方舟官方','2026-05-23 21:27:25.940576','246619214',3),(24,'审核通过','1','2026-05-23 21:34:29.476394','193721180',4),(25,'审核通过','不对','2026-05-23 21:36:15.645450','193721180',5),(26,'审核通过','666','2026-05-23 22:07:13.724466','437346159',9),(27,'审核通过','楼主怎么能+325','2026-05-23 22:35:38.559775','437346159',1),(28,'审核通过','系统管理员有什么修改个人信息的必要吗，或者说个人信息中有什么东西是系统管理员了解得比本人更多的，从而👐🏻没人比我更懂你🙌🏻咔地一下就把个人信息改了','2026-05-24 00:12:24.031353','193721180',12),(29,'审核通过','兄弟，是这样的，兄弟，我们的用户在注册的时候是没经过审核的，要是头像或昵称违规了，管理员可以直接修改','2026-05-24 00:12:40.339014','193721180',12),(30,'审核通过','不是哥们，猪蹄频道哪来的头像🤨🤪','2026-05-24 00:13:12.414514','193721180',12),(31,'审核通过','那就只能改昵称了吧😄😂🤣','2026-05-24 00:13:47.169728','193721180',12),(32,'审核通过','💩道淋头了都，不知道楼上在笑什么🙃','2026-05-24 00:15:00.559522','193721180',12),(33,'审核通过','来不及了真要来不及了😰😱😭','2026-05-24 00:22:02.439868','437346159',12),(34,'审核通过','111真要么','2026-05-24 00:22:24.252337','193721180',13),(35,'审核通过','哦对了，个人主页也可以修改，顺便把那雷霆通知加进去','2026-05-24 00:23:17.481485','193721180',13),(36,'审核通过','你改你雷霆战锤，还要写数据往数据库里插呢，哪有那么多时间','2026-05-24 00:26:41.137167','193721180',13),(37,'审核通过','闹麻了，每次软件工程都连滚带爬，与其端上依托精心制作的史不如就端上原汁原味的史，反正结果都一样🤣','2026-05-24 00:29:15.379224','193721180',13),(38,'审核通过','心疼楼主，摸摸','2026-05-24 00:35:46.613157','690296289',13),(39,'审核通过','你说完了我说什么','2026-05-24 00:39:53.024519','246619214',13),(40,'审核通过','你说完了我说什么','2026-05-24 00:40:26.995759','246619214',12),(41,'审核通过','凝滞师','2026-05-24 12:51:34.058100','246619214',11),(52,'审核通过','这是帖子《测试频道2的帖子1》的测试评论','2026-05-24 16:43:20.385017','857657658',24),(53,'审核通过','这是帖子《测试频道2的帖子2》的测试评论','2026-05-24 16:43:20.388713','857657658',25),(54,'审核通过','这是帖子《测试频道2的帖子3》的测试评论','2026-05-24 16:43:20.392465','616214171',26),(55,'审核通过','这是帖子《测试频道2的帖子4》的测试评论','2026-05-24 16:43:20.396100','616214171',27),(56,'审核通过','这是帖子《测试频道2的帖子5》的测试评论','2026-05-24 16:43:20.399517','869086462',28),(57,'审核通过','这是帖子《测试频道2的帖子6》的测试评论','2026-05-24 16:43:20.403699','869086462',29),(58,'审核通过','这是帖子《测试频道2的帖子7》的测试评论','2026-05-24 16:43:20.407248','800385698',30),(59,'审核通过','这是帖子《测试频道2的帖子8》的测试评论','2026-05-24 16:43:20.411270','857657658',31),(60,'审核通过','这是帖子《测试频道2的帖子9》的测试评论','2026-05-24 16:43:20.415338','616214171',32),(61,'审核通过','这是帖子《测试频道2的帖子10》的测试评论','2026-05-24 16:43:20.419692','800385698',33),(62,'审核通过','这是帖子《测试频道3的帖子1》的测试评论','2026-05-24 16:43:20.423586','800385698',34),(63,'审核通过','这是帖子《测试频道3的帖子2》的测试评论','2026-05-24 16:43:20.427469','869086462',35),(64,'审核通过','这是帖子《测试频道3的帖子3》的测试评论','2026-05-24 16:43:20.430824','800385698',36),(65,'审核通过','这是帖子《测试频道3的帖子4》的测试评论','2026-05-24 16:43:20.434721','616214171',37),(66,'审核通过','这是帖子《测试频道3的帖子5》的测试评论','2026-05-24 16:43:20.438174','869086462',38),(67,'审核通过','这是帖子《测试频道3的帖子6》的测试评论','2026-05-24 16:43:20.441859','869086462',39),(68,'审核通过','这是帖子《测试频道3的帖子7》的测试评论','2026-05-24 16:43:20.445291','616214171',40),(69,'审核通过','这是帖子《测试频道3的帖子8》的测试评论','2026-05-24 16:43:20.451350','869086462',41),(70,'审核通过','这是帖子《测试频道3的帖子9》的测试评论','2026-05-24 16:43:20.464327','800385698',42),(71,'审核通过','这是帖子《测试频道3的帖子10》的测试评论','2026-05-24 16:43:20.467762','616214171',43),(72,'审核通过','这是帖子《测试频道4的帖子1》的测试评论','2026-05-24 16:43:20.471376','232031446',44),(73,'审核通过','这是帖子《测试频道4的帖子2》的测试评论','2026-05-24 16:43:20.475877','869086462',45),(74,'审核通过','这是帖子《测试频道4的帖子3》的测试评论','2026-05-24 16:43:20.480306','869086462',46),(75,'审核通过','这是帖子《测试频道4的帖子4》的测试评论','2026-05-24 16:43:20.484529','857657658',47),(76,'审核通过','这是帖子《测试频道4的帖子5》的测试评论','2026-05-24 16:43:20.489804','857657658',48),(77,'审核通过','这是帖子《测试频道4的帖子6》的测试评论','2026-05-24 16:43:20.499126','857657658',49),(78,'审核通过','这是帖子《测试频道4的帖子7》的测试评论','2026-05-24 16:43:20.502020','869086462',50),(79,'审核通过','这是帖子《测试频道4的帖子8》的测试评论','2026-05-24 16:43:20.505162','869086462',51),(80,'审核通过','这是帖子《测试频道4的帖子9》的测试评论','2026-05-24 16:43:20.512002','857657658',52),(81,'审核通过','这是帖子《测试频道4的帖子10》的测试评论','2026-05-24 16:43:20.515999','616214171',53),(102,'审核通过','这是帖子《测试频道7的帖子1》的测试评论','2026-05-24 16:43:20.626122','616214171',74),(103,'审核通过','这是帖子《测试频道7的帖子2》的测试评论','2026-05-24 16:43:20.629199','869086462',75),(104,'审核通过','这是帖子《测试频道7的帖子3》的测试评论','2026-05-24 16:43:20.632604','232031446',76),(105,'审核通过','这是帖子《测试频道7的帖子4》的测试评论','2026-05-24 16:43:20.635791','232031446',77),(106,'审核通过','这是帖子《测试频道7的帖子5》的测试评论','2026-05-24 16:43:20.638980','857657658',78),(107,'审核通过','这是帖子《测试频道7的帖子6》的测试评论','2026-05-24 16:43:20.642376','800385698',79),(108,'审核通过','这是帖子《测试频道7的帖子7》的测试评论','2026-05-24 16:43:20.645671','857657658',80),(109,'审核通过','这是帖子《测试频道7的帖子8》的测试评论','2026-05-24 16:43:20.648789','616214171',81),(110,'审核通过','这是帖子《测试频道7的帖子9》的测试评论','2026-05-24 16:43:20.652296','800385698',82),(111,'审核通过','这是帖子《测试频道7的帖子10》的测试评论','2026-05-24 16:43:20.655712','232031446',83),(112,'审核通过','这是帖子《测试频道8的帖子1》的测试评论','2026-05-24 16:43:20.658961','616214171',84),(113,'审核通过','这是帖子《测试频道8的帖子2》的测试评论','2026-05-24 16:43:20.662290','232031446',85),(114,'审核通过','这是帖子《测试频道8的帖子3》的测试评论','2026-05-24 16:43:20.665755','616214171',86),(115,'审核通过','这是帖子《测试频道8的帖子4》的测试评论','2026-05-24 16:43:20.669655','857657658',87),(116,'审核通过','这是帖子《测试频道8的帖子5》的测试评论','2026-05-24 16:43:20.673255','232031446',88),(117,'审核通过','这是帖子《测试频道8的帖子6》的测试评论','2026-05-24 16:43:20.677471','869086462',89),(118,'审核通过','这是帖子《测试频道8的帖子7》的测试评论','2026-05-24 16:43:20.685851','869086462',90),(119,'审核通过','这是帖子《测试频道8的帖子8》的测试评论','2026-05-24 16:43:20.689250','616214171',91),(120,'审核通过','这是帖子《测试频道8的帖子9》的测试评论','2026-05-24 16:43:20.697640','857657658',92),(121,'审核通过','这是帖子《测试频道8的帖子10》的测试评论','2026-05-24 16:43:20.703904','800385698',93),(122,'审核通过','这是帖子《测试频道9的帖子1》的测试评论','2026-05-24 16:43:20.708484','616214171',94),(123,'审核通过','这是帖子《测试频道9的帖子2》的测试评论','2026-05-24 16:43:20.712534','857657658',95),(124,'审核通过','这是帖子《测试频道9的帖子3》的测试评论','2026-05-24 16:43:20.715864','869086462',96),(125,'审核通过','这是帖子《测试频道9的帖子4》的测试评论','2026-05-24 16:43:20.719531','232031446',97),(126,'审核通过','这是帖子《测试频道9的帖子5》的测试评论','2026-05-24 16:43:20.722838','800385698',98),(127,'审核通过','这是帖子《测试频道9的帖子6》的测试评论','2026-05-24 16:43:20.726192','616214171',99),(128,'审核通过','这是帖子《测试频道9的帖子7》的测试评论','2026-05-24 16:43:20.729382','800385698',100),(129,'审核通过','这是帖子《测试频道9的帖子8》的测试评论','2026-05-24 16:43:20.733065','869086462',101),(130,'审核通过','这是帖子《测试频道9的帖子9》的测试评论','2026-05-24 16:43:20.736918','869086462',102),(131,'审核通过','这是帖子《测试频道9的帖子10》的测试评论','2026-05-24 16:43:20.740190','869086462',103),(142,'审核通过','第1条测试评论','2026-02-13 08:00:00.000000','800385698',119),(143,'审核通过','第2条测试评论','2026-02-14 08:00:00.000000','800385698',119),(144,'审核通过','第3条测试评论','2026-02-15 08:00:00.000000','800385698',119),(145,'审核通过','第4条测试评论','2026-02-16 08:00:00.000000','800385698',119),(146,'审核通过','第5条测试评论','2026-02-17 08:00:00.000000','800385698',119),(147,'审核通过','第6条测试评论','2026-02-18 08:00:00.000000','800385698',119),(148,'审核通过','第7条测试评论','2026-02-19 08:00:00.000000','800385698',119),(149,'审核通过','第8条测试评论','2026-02-20 08:00:00.000000','800385698',119),(150,'审核通过','第9条测试评论','2026-02-21 08:00:00.000000','800385698',119),(151,'审核通过','第10条测试评论','2026-02-22 08:00:00.000000','800385698',119),(152,'审核通过','第11条测试评论','2026-02-23 08:00:00.000000','800385698',119),(153,'审核通过','第12条测试评论','2026-02-24 08:00:00.000000','800385698',119),(154,'审核通过','第13条测试评论','2026-02-25 08:00:00.000000','800385698',119),(155,'审核通过','第14条测试评论','2026-02-26 08:00:00.000000','800385698',119),(156,'审核通过','第15条测试评论','2026-02-27 08:00:00.000000','800385698',119),(157,'审核通过','第16条测试评论','2026-02-28 08:00:00.000000','800385698',119),(158,'审核通过','第17条测试评论','2026-03-01 08:00:00.000000','800385698',119),(159,'审核通过','第18条测试评论','2026-03-02 08:00:00.000000','800385698',119),(160,'审核通过','第19条测试评论','2026-03-03 08:00:00.000000','800385698',119),(161,'审核通过','第20条测试评论','2026-03-04 08:00:00.000000','800385698',119),(162,'审核通过','第21条测试评论','2026-03-05 08:00:00.000000','800385698',119),(163,'审核通过','第22条测试评论','2026-03-06 08:00:00.000000','800385698',119),(164,'审核通过','第23条测试评论','2026-03-07 08:00:00.000000','800385698',119),(165,'审核通过','第24条测试评论','2026-03-08 08:00:00.000000','800385698',119),(166,'审核通过','第25条测试评论','2026-03-09 08:00:00.000000','800385698',119),(167,'审核通过','第26条测试评论','2026-03-10 08:00:00.000000','800385698',119),(168,'审核通过','第27条测试评论','2026-03-11 08:00:00.000000','800385698',119),(169,'审核通过','第28条测试评论','2026-03-12 08:00:00.000000','800385698',119),(170,'审核通过','第29条测试评论','2026-03-13 08:00:00.000000','800385698',119),(171,'审核通过','第30条测试评论','2026-03-14 08:00:00.000000','800385698',119),(172,'审核通过','第31条测试评论','2026-03-15 08:00:00.000000','800385698',119),(173,'审核通过','第32条测试评论','2026-03-16 08:00:00.000000','800385698',119),(174,'审核通过','第33条测试评论','2026-03-17 08:00:00.000000','800385698',119),(175,'审核通过','第34条测试评论','2026-03-18 08:00:00.000000','800385698',119),(176,'审核通过','第35条测试评论','2026-03-19 08:00:00.000000','800385698',119),(177,'审核通过','第36条测试评论','2026-03-20 08:00:00.000000','800385698',119),(178,'审核通过','第37条测试评论','2026-03-21 08:00:00.000000','800385698',119),(179,'审核通过','第38条测试评论','2026-03-22 08:00:00.000000','800385698',119),(180,'审核通过','第39条测试评论','2026-03-23 08:00:00.000000','800385698',119),(181,'审核通过','第40条测试评论','2026-03-24 08:00:00.000000','800385698',119),(182,'审核通过','第41条测试评论','2026-03-25 08:00:00.000000','800385698',119),(183,'审核通过','第42条测试评论','2026-03-26 08:00:00.000000','800385698',119),(184,'审核通过','第43条测试评论','2026-03-27 08:00:00.000000','800385698',119),(185,'审核通过','第44条测试评论','2026-03-28 08:00:00.000000','800385698',119),(186,'审核通过','第45条测试评论','2026-03-29 08:00:00.000000','800385698',119),(187,'审核通过','第46条测试评论','2026-03-30 08:00:00.000000','800385698',119),(188,'审核通过','第47条测试评论','2026-03-31 08:00:00.000000','800385698',119),(189,'审核通过','第48条测试评论','2026-04-01 08:00:00.000000','800385698',119),(190,'审核通过','第49条测试评论','2026-04-02 08:00:00.000000','800385698',119),(191,'审核通过','第50条测试评论','2026-04-03 08:00:00.000000','800385698',119),(192,'审核通过','第51条测试评论','2026-04-04 08:00:00.000000','800385698',119),(193,'审核通过','第52条测试评论','2026-04-05 08:00:00.000000','800385698',119),(194,'审核通过','第53条测试评论','2026-04-06 08:00:00.000000','800385698',119),(195,'审核通过','第54条测试评论','2026-04-07 08:00:00.000000','800385698',119),(196,'审核通过','第55条测试评论','2026-04-08 08:00:00.000000','800385698',119),(197,'审核通过','第56条测试评论','2026-04-09 08:00:00.000000','800385698',119),(198,'审核通过','第57条测试评论','2026-04-10 08:00:00.000000','800385698',119),(199,'审核通过','第58条测试评论','2026-04-11 08:00:00.000000','800385698',119),(200,'审核通过','第59条测试评论','2026-04-12 08:00:00.000000','800385698',119),(201,'审核通过','第60条测试评论','2026-04-13 08:00:00.000000','800385698',119),(202,'审核通过','第61条测试评论','2026-04-14 08:00:00.000000','800385698',119),(203,'审核通过','第62条测试评论','2026-04-15 08:00:00.000000','800385698',119),(204,'审核通过','第63条测试评论','2026-04-16 08:00:00.000000','800385698',119),(205,'审核通过','第64条测试评论','2026-04-17 08:00:00.000000','800385698',119),(206,'审核通过','第65条测试评论','2026-04-18 08:00:00.000000','800385698',119),(207,'审核通过','第66条测试评论','2026-04-19 08:00:00.000000','800385698',119),(208,'审核通过','第67条测试评论','2026-04-20 08:00:00.000000','800385698',119),(209,'审核通过','第68条测试评论','2026-04-21 08:00:00.000000','800385698',119),(210,'审核通过','第69条测试评论','2026-04-22 08:00:00.000000','800385698',119),(211,'审核通过','第70条测试评论','2026-04-23 08:00:00.000000','800385698',119),(212,'审核通过','第71条测试评论','2026-04-24 08:00:00.000000','800385698',119),(213,'审核通过','第72条测试评论','2026-04-25 08:00:00.000000','800385698',119),(214,'审核通过','第73条测试评论','2026-04-26 08:00:00.000000','800385698',119),(215,'审核通过','第74条测试评论','2026-04-27 08:00:00.000000','800385698',119),(216,'审核通过','第75条测试评论','2026-04-28 08:00:00.000000','800385698',119),(217,'审核通过','第76条测试评论','2026-04-29 08:00:00.000000','800385698',119),(218,'审核通过','第77条测试评论','2026-04-30 08:00:00.000000','800385698',119),(219,'审核通过','第78条测试评论','2026-05-01 08:00:00.000000','800385698',119),(220,'审核通过','第79条测试评论','2026-05-02 08:00:00.000000','800385698',119),(221,'审核通过','第80条测试评论','2026-05-03 08:00:00.000000','800385698',119),(222,'审核通过','第81条测试评论','2026-05-04 08:00:00.000000','800385698',119),(223,'审核通过','第82条测试评论','2026-05-05 08:00:00.000000','800385698',119),(224,'审核通过','第83条测试评论','2026-05-06 08:00:00.000000','800385698',119),(225,'审核通过','第84条测试评论','2026-05-07 08:00:00.000000','800385698',119),(226,'审核通过','第85条测试评论','2026-05-08 08:00:00.000000','800385698',119),(227,'审核通过','第86条测试评论','2026-05-09 08:00:00.000000','800385698',119),(228,'审核通过','第87条测试评论','2026-05-10 08:00:00.000000','800385698',119),(229,'审核通过','第88条测试评论','2026-05-11 08:00:00.000000','800385698',119),(230,'审核通过','第89条测试评论','2026-05-12 08:00:00.000000','800385698',119),(231,'审核通过','第90条测试评论','2026-05-13 08:00:00.000000','800385698',119),(232,'审核通过','第91条测试评论','2026-05-14 08:00:00.000000','800385698',119),(233,'审核通过','第92条测试评论','2026-05-15 08:00:00.000000','800385698',119),(234,'审核通过','第93条测试评论','2026-05-16 08:00:00.000000','800385698',119),(235,'审核通过','第94条测试评论','2026-05-17 08:00:00.000000','800385698',119),(236,'审核通过','第95条测试评论','2026-05-18 08:00:00.000000','800385698',119),(237,'审核通过','第96条测试评论','2026-05-19 08:00:00.000000','800385698',119),(238,'审核通过','第97条测试评论','2026-05-20 08:00:00.000000','800385698',119),(239,'审核通过','第98条测试评论','2026-05-21 08:00:00.000000','800385698',119),(240,'审核通过','第99条测试评论','2026-05-22 08:00:00.000000','800385698',119),(241,'审核通过','第100条测试评论','2026-05-23 08:00:00.000000','800385698',119),(242,'审核通过','这不是第102条测试评论','2026-05-25 08:43:51.324107','437346159',119),(243,'审核通过','收到','2026-05-25 08:49:34.499478','993063755',120),(245,'审核通过','什么时候去','2026-05-25 10:59:25.018260','993063755',120),(246,'审核通过','什么时候吃饭','2026-05-25 11:01:09.200999','993063755',120),(250,'审核通过','不准水贴','2026-05-25 13:01:35.196487','246619214',126),(251,'审核通过','你好','2026-05-25 13:25:28.552015','993063755',133);
/*!40000 ALTER TABLE `comment` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `forum`
--

DROP TABLE IF EXISTS `forum`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `forum` (
  `forum_id` bigint NOT NULL AUTO_INCREMENT,
  `audit_state` varchar(255) DEFAULT NULL,
  `content` text,
  `create_time` datetime(6) DEFAULT NULL,
  `forum_name` varchar(255) NOT NULL,
  `user_id` varchar(255) NOT NULL,
  PRIMARY KEY (`forum_id`),
  KEY `FKx2frsa7e4ymsb7xx71b9l25g` (`user_id`),
  CONSTRAINT `FKx2frsa7e4ymsb7xx71b9l25g` FOREIGN KEY (`user_id`) REFERENCES `ordinary_user` (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=27 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `forum`
--

LOCK TABLES `forum` WRITE;
/*!40000 ALTER TABLE `forum` DISABLE KEYS */;
INSERT INTO `forum` VALUES (1,'审核通过','系统默认频道，欢迎加入交流','2026-05-23 16:37:57.214335','默认频道','690296289'),(2,'审核通过','神秘而美丽','2026-05-23 17:39:46.918648','星极吧','193721180'),(3,'审核通过','ARKNIGHTS','2026-05-23 17:47:19.534288','明日方舟','437346159'),(4,'审核通过','creeper？','2026-05-23 17:52:38.603123','Minecraft 吧','246619214'),(5,'审核通过','NUAA','2026-05-23 18:23:35.952780','南京航空航天大学吧','437346159'),(6,'审核通过','Orchid','2026-05-23 18:24:49.909144','梓兰吧','437346159'),(7,'审核通过','654321','2026-05-23 22:50:42.963325','654321','193721180'),(8,'审核通过','topicchannelplatformofficial','2026-05-24 09:37:14.779975','主题频道交流吧吧','193721180'),(9,'审核通过','软件工程','2026-05-24 11:40:26.890134','软件工程','437346159'),(11,'审核通过','这是测试频道2的简介','2026-05-24 16:43:19.508969','测试频道2','857657658'),(12,'审核通过','这是测试频道3的简介','2026-05-24 16:43:19.568048','测试频道3','616214171'),(13,'审核通过','这是测试频道4的简介','2026-05-24 16:43:19.609917','测试频道4','869086462'),(16,'审核通过','这是测试频道7的简介','2026-05-24 16:43:19.710387','测试频道7','857657658'),(17,'审核通过','这是测试频道8的简介','2026-05-24 16:43:19.742148','测试频道8','616214171'),(18,'审核通过','这是测试频道9的简介','2026-05-24 16:43:19.773612','测试频道9','869086462'),(21,'审核通过','这是用于系统测试的主题频道','2026-02-12 08:00:00.000000','日期测试频道','800385698'),(25,'审核通过','1105寝室御用㊗️蹄','2026-05-25 11:25:06.274252','众众人帮','246619214'),(26,'审核通过','111','2026-05-25 13:24:38.726509','nihao','139043378');
/*!40000 ALTER TABLE `forum` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `forum_member`
--

DROP TABLE IF EXISTS `forum_member`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `forum_member` (
  `join_time` datetime(6) DEFAULT NULL,
  `forum_id` bigint NOT NULL,
  `user_id` varchar(255) NOT NULL,
  PRIMARY KEY (`forum_id`,`user_id`),
  KEY `FKp11m6e8wi9uojuf5ok5qo4txp` (`user_id`),
  CONSTRAINT `FK86l4f64t1wrap4ddcde7x9ifl` FOREIGN KEY (`forum_id`) REFERENCES `forum` (`forum_id`),
  CONSTRAINT `FKp11m6e8wi9uojuf5ok5qo4txp` FOREIGN KEY (`user_id`) REFERENCES `ordinary_user` (`user_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `forum_member`
--

LOCK TABLES `forum_member` WRITE;
/*!40000 ALTER TABLE `forum_member` DISABLE KEYS */;
INSERT INTO `forum_member` VALUES ('2026-05-25 13:23:47.875820',1,'139043378'),('2026-05-24 00:04:23.634637',1,'193721180'),('2026-05-23 17:49:56.377998',1,'246619214'),('2026-05-24 17:52:21.671234',1,'437346159'),('2026-05-23 16:37:57.255660',1,'690296289'),('2026-05-23 22:38:01.058924',2,'193721180'),('2026-05-23 17:49:54.999736',2,'246619214'),('2026-05-23 18:00:15.890074',2,'437346159'),('2026-05-24 21:47:01.808859',2,'765390751'),('2026-05-23 18:46:13.840703',2,'797754129'),('2026-05-23 18:09:06.790426',3,'063119958'),('2026-05-23 17:49:53.375456',3,'246619214'),('2026-05-23 17:47:19.548580',3,'437346159'),('2026-05-23 18:48:24.575095',3,'797754129'),('2026-05-23 21:34:24.905719',4,'193721180'),('2026-05-23 17:52:38.615701',4,'246619214'),('2026-05-23 17:55:56.070910',4,'437346159'),('2026-05-23 21:26:04.262530',5,'246619214'),('2026-05-23 18:23:35.963910',5,'437346159'),('2026-05-23 21:26:14.341638',6,'246619214'),('2026-05-23 18:24:49.916804',6,'437346159'),('2026-05-23 22:59:01.394388',7,'193721180'),('2026-05-24 09:37:14.787296',8,'193721180'),('2026-05-24 17:51:34.312908',8,'437346159'),('2026-05-24 11:40:26.897064',9,'437346159'),('2026-05-25 08:58:14.763852',9,'993063755'),('2026-05-24 16:43:19.547067',11,'616214171'),('2026-05-24 16:43:19.537709',11,'857657658'),('2026-05-24 16:43:19.558217',11,'869086462'),('2026-05-24 16:43:19.598828',12,'616214171'),('2026-05-24 16:43:19.591459',12,'857657658'),('2026-05-24 16:43:19.604338',12,'869086462'),('2026-05-24 16:43:19.635922',13,'616214171'),('2026-05-24 16:43:19.630481',13,'857657658'),('2026-05-24 16:43:19.641263',13,'869086462'),('2026-05-24 16:43:19.730404',16,'616214171'),('2026-05-24 16:43:19.725522',16,'857657658'),('2026-05-24 16:43:19.735372',16,'869086462'),('2026-05-24 16:43:19.763016',17,'616214171'),('2026-05-24 16:43:19.757925',17,'857657658'),('2026-05-24 16:43:19.768145',17,'869086462'),('2026-05-24 16:43:19.793081',18,'616214171'),('2026-05-24 16:43:19.788115',18,'857657658'),('2026-05-24 16:43:19.798072',18,'869086462'),('2026-05-25 08:43:23.895192',21,'437346159'),('2026-05-25 11:25:06.287158',25,'246619214'),('2026-05-25 13:15:14.763051',25,'437346159'),('2026-05-25 12:53:23.518869',25,'993063755'),('2026-05-25 13:24:38.738282',26,'139043378'),('2026-05-25 13:24:48.083795',26,'993063755');
/*!40000 ALTER TABLE `forum_member` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `ordinary_user`
--

DROP TABLE IF EXISTS `ordinary_user`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `ordinary_user` (
  `user_id` varchar(255) NOT NULL,
  `user_password` varchar(255) NOT NULL,
  `birthday` datetime(6) DEFAULT NULL,
  `gender` varchar(255) DEFAULT NULL,
  `id_number` varchar(255) DEFAULT NULL,
  `phone_number` varchar(255) NOT NULL,
  `real_name` varchar(255) DEFAULT NULL,
  `register_time` datetime(6) DEFAULT NULL,
  `status` varchar(255) NOT NULL,
  `user_name` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`user_id`),
  UNIQUE KEY `UK8t7pjn1scjt6ytoh4wm5gndd0` (`phone_number`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `ordinary_user`
--

LOCK TABLES `ordinary_user` WRITE;
/*!40000 ALTER TABLE `ordinary_user` DISABLE KEYS */;
INSERT INTO `ordinary_user` VALUES ('054026632','$2a$10$VuItDEDm26GZL63grFgW9exJAMHQZ/D.RqjkWYO8DfcpdqwFeO6aC',NULL,NULL,NULL,'18800000001',NULL,'2026-05-25 10:29:36.191224','normal','梓兰'),('063119958','$2a$10$O/kfdgGALyoAe80Q4KMj0efMB5v05TzuVjcJ.laOOCEHiCOfazum6',NULL,NULL,NULL,'18334349071',NULL,'2026-05-23 18:08:45.963351','normal','arkbai'),('139043378','$2a$10$ML.2Q2CLOmspd6/VkUSAuOq5N./ckCQefol9VUkFUD4gxS45UJt26',NULL,NULL,NULL,'13814000968',NULL,'2026-05-25 13:22:46.168219','normal','1234'),('193721180','$2a$10$dmc3ufE7MD.qEkEmSPGCHeMUomz4hAGV/ADUYchezbR6IPp67yPVi','2010-04-03 08:00:00.000000','男','','15257876990','张三','2026-05-23 17:39:19.633157','normal','OrionAstesia'),('232031446','$2a$10$6lm0M2DUL4zH5xE3qc6Rm.qLwOAzRvDWxRqyX.gcbMGlLnnyjchjq',NULL,NULL,NULL,'13800000002',NULL,'2026-05-24 16:43:19.046573','deleted','测试用户2'),('246619214','$2a$10$PCQRrMGZ5zo/887XqeJrYerZhWISddt.zizVDVS13mZJbNARYj1z.',NULL,NULL,NULL,'15294795974',NULL,'2026-05-23 17:49:28.500921','normal','yaqisama'),('437346159','$2a$10$0akMnXxnEQtrkwhRg9YgvuwvRYUkE/tvTSShdzjPtU3yFIbh3mKke','2026-05-06 08:00:00.000000','男','111111202605011111','18852333273','张三','2026-05-23 17:45:45.637473','normal','明日方舟_official'),('616214171','$2a$10$Y9VUEM8H7oQynu3SouxkJeFE.dWvpeEb1JvfI2a/4XBhwXRFk9/ru',NULL,NULL,NULL,'13800000004',NULL,'2026-05-24 16:43:19.235813','normal','测试用户4'),('690296289','$2a$10$tuFxOIIdwjLhq8ul2oQj8uLxEZ6jV.6gy2NjGB7mAwpM5mljEadq2',NULL,NULL,NULL,'13800000000',NULL,'2026-05-23 16:37:57.160009','normal','test'),('706522720','$2a$10$xiND0PQgWPsyc0H/E6HMc./nDk5Rch4OSUJKtWko9WJy4J9HNmzGG',NULL,NULL,NULL,'12300050006',NULL,'2026-05-25 11:18:32.522106','deleted','test22'),('765390751','$2a$10$Akk4LV/O8XiWiZTjkZOBI.rIgMNISvsITW8zmfIVUThWqlpVqHQsK',NULL,NULL,NULL,'11111111111',NULL,'2026-05-23 22:09:43.405848','normal','off'),('797754129','$2a$10$jlgjvbV3XL7bIFtlvQInpePK5UsThjpKa.gc6.u28V2V9VzvQSO16',NULL,NULL,NULL,'18303663722',NULL,'2026-05-23 18:45:00.885329','normal','星极小姐'),('800385698','$2a$10$MydQ90HQVOVq/Ta6aojVhuf4RKGKDnPAMzp1LWcxIdYeOI.Er8C22',NULL,NULL,NULL,'13800000001',NULL,'2026-05-24 16:43:18.852754','deleted','测试用户1'),('857657658','$2a$10$8LQMbdIfVo1QRV7pYnqEWey.NJNLarHzKWWEwEzCBIIMh6AXP0IVe',NULL,NULL,NULL,'13800000003',NULL,'2026-05-24 16:43:19.147553','normal','测试用户3'),('869086462','$2a$10$wGFt80.Vb1.pp/vgI3pCfOlSV4KHS9kyWj8P3MSKu5q42PPZjkQAi',NULL,NULL,NULL,'13800000005',NULL,'2026-05-24 16:43:19.326812','normal','测试用户5'),('971295262','$2a$10$EL6jx5R1Q3ueoE9UiBOAceQ7BgW0Td0yRnUr0ynn4IIa/locB4l8a',NULL,NULL,NULL,'13500000000',NULL,'2026-05-25 08:19:42.820868','normal','1'),('993063755','$2a$10$c.i00Lj9JAhncirYqqYn9OlI1ZRhhroB8VC1XJuwDHgtc/P7.XBKO',NULL,NULL,NULL,'18800000000',NULL,'2026-05-25 08:55:36.891670','normal','濯缨'),('997602667','$2a$10$iVTSXXZmsblugJZP74SN3.8KbzqX2SWSE5DLSbAD9gCBgIxI/RPO6','2020-02-29 08:00:00.000000','男','111111199911111111','12345678901','','2026-05-25 11:09:38.720058','deleted','ceshi');
/*!40000 ALTER TABLE `ordinary_user` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `theme_post`
--

DROP TABLE IF EXISTS `theme_post`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `theme_post` (
  `theme_post_id` bigint NOT NULL AUTO_INCREMENT,
  `audit_state` varchar(255) DEFAULT NULL,
  `content` text,
  `publish_time` datetime(6) DEFAULT NULL,
  `title` varchar(255) NOT NULL,
  `user_id` varchar(255) NOT NULL,
  `forum_id` bigint NOT NULL,
  PRIMARY KEY (`theme_post_id`),
  KEY `FK8t6lassya2gehts4vl8bfqhv0` (`user_id`),
  KEY `FK3k8p0ls5l8jv1gja4eydktwtc` (`forum_id`),
  CONSTRAINT `FK3k8p0ls5l8jv1gja4eydktwtc` FOREIGN KEY (`forum_id`) REFERENCES `forum` (`forum_id`),
  CONSTRAINT `FK8t6lassya2gehts4vl8bfqhv0` FOREIGN KEY (`user_id`) REFERENCES `ordinary_user` (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=134 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `theme_post`
--

LOCK TABLES `theme_post` WRITE;
/*!40000 ALTER TABLE `theme_post` DISABLE KEYS */;
INSERT INTO `theme_post` VALUES (1,'审核通过','经验+325','2026-05-23 17:40:41.920883','今日没有星极图','193721180',2),(2,'审核通过','呼呼呼','2026-05-23 17:50:23.532322','😈','246619214',2),(3,'审核通过','大家快来玩啊，参与评论没有几率获得奖励：阿米娅1：7手办*0，随机通行证*00。','2026-05-23 17:51:13.368562','明日方舟官方正式入驻主题频道交流平台啦！','437346159',3),(4,'审核通过','man','2026-05-23 17:55:53.629754','awwwl','193721180',4),(5,'审核通过','萨瓦迪卡','2026-05-23 17:56:12.178227','有人吗','437346159',4),(6,'审核通过','gogogo','2026-05-23 18:10:17.051071','麒麟夜刀','063119958',3),(7,'审核通过','明日方舟和怪物猎人联动活动将于六月上旬正式开始，敬请期待！','2026-05-23 18:26:36.936635','明日方舟 X MONSTER HUNTER','437346159',3),(8,'审核通过','不错😄','2026-05-23 18:47:07.020435','星极小姐来参观了','797754129',2),(9,'审核通过','要验收了怎么办','2026-05-23 21:25:53.639359','软工课设写完了吗','437346159',5),(10,'审核通过','？？','2026-05-23 21:26:09.877460','这是啥','246619214',1),(11,'审核通过','梓兰异格可能是什么职业呢','2026-05-23 21:45:26.299987','有没有怪猎大手子','437346159',6),(12,'审核通过','3个通知给我CPU干烧了','2026-05-24 00:05:12.473161','这雷霆报告','193721180',1),(13,'审核通过','管理员要搜索用户吧，要update信息吧，update只能修改昵称吧','2026-05-24 00:19:38.783188','明天干什么','193721180',1),(24,'审核通过','这是测试频道2下第1篇测试帖子的正文内容','2026-05-24 16:43:19.889765','测试频道2的帖子1','800385698',11),(25,'审核通过','这是测试频道2下第2篇测试帖子的正文内容','2026-05-24 16:43:19.894076','测试频道2的帖子2','232031446',11),(26,'审核通过','这是测试频道2下第3篇测试帖子的正文内容','2026-05-24 16:43:19.898562','测试频道2的帖子3','857657658',11),(27,'审核通过','这是测试频道2下第4篇测试帖子的正文内容','2026-05-24 16:43:19.904485','测试频道2的帖子4','616214171',11),(28,'审核通过','这是测试频道2下第5篇测试帖子的正文内容','2026-05-24 16:43:19.908957','测试频道2的帖子5','869086462',11),(29,'审核通过','这是测试频道2下第6篇测试帖子的正文内容','2026-05-24 16:43:19.913222','测试频道2的帖子6','800385698',11),(30,'审核通过','这是测试频道2下第7篇测试帖子的正文内容','2026-05-24 16:43:19.917528','测试频道2的帖子7','232031446',11),(31,'审核通过','这是测试频道2下第8篇测试帖子的正文内容','2026-05-24 16:43:19.921951','测试频道2的帖子8','857657658',11),(32,'审核通过','这是测试频道2下第9篇测试帖子的正文内容','2026-05-24 16:43:19.926341','测试频道2的帖子9','616214171',11),(33,'审核通过','这是测试频道2下第10篇测试帖子的正文内容','2026-05-24 16:43:19.931186','测试频道2的帖子10','869086462',11),(34,'审核通过','这是测试频道3下第1篇测试帖子的正文内容','2026-05-24 16:43:19.935325','测试频道3的帖子1','800385698',12),(35,'审核通过','这是测试频道3下第2篇测试帖子的正文内容','2026-05-24 16:43:19.939802','测试频道3的帖子2','232031446',12),(36,'审核通过','这是测试频道3下第3篇测试帖子的正文内容','2026-05-24 16:43:19.944037','测试频道3的帖子3','857657658',12),(37,'审核通过','这是测试频道3下第4篇测试帖子的正文内容','2026-05-24 16:43:19.949728','测试频道3的帖子4','616214171',12),(38,'审核通过','这是测试频道3下第5篇测试帖子的正文内容','2026-05-24 16:43:19.954463','测试频道3的帖子5','869086462',12),(39,'审核通过','这是测试频道3下第6篇测试帖子的正文内容','2026-05-24 16:43:19.958999','测试频道3的帖子6','800385698',12),(40,'审核通过','这是测试频道3下第7篇测试帖子的正文内容','2026-05-24 16:43:19.963162','测试频道3的帖子7','232031446',12),(41,'审核通过','这是测试频道3下第8篇测试帖子的正文内容','2026-05-24 16:43:19.967533','测试频道3的帖子8','857657658',12),(42,'审核通过','这是测试频道3下第9篇测试帖子的正文内容','2026-05-24 16:43:19.971991','测试频道3的帖子9','616214171',12),(43,'审核通过','这是测试频道3下第10篇测试帖子的正文内容','2026-05-24 16:43:19.976218','测试频道3的帖子10','869086462',12),(44,'审核通过','这是测试频道4下第1篇测试帖子的正文内容','2026-05-24 16:43:19.980668','测试频道4的帖子1','800385698',13),(45,'审核通过','这是测试频道4下第2篇测试帖子的正文内容','2026-05-24 16:43:19.984808','测试频道4的帖子2','232031446',13),(46,'审核通过','这是测试频道4下第3篇测试帖子的正文内容','2026-05-24 16:43:19.991581','测试频道4的帖子3','857657658',13),(47,'审核通过','这是测试频道4下第4篇测试帖子的正文内容','2026-05-24 16:43:19.998522','测试频道4的帖子4','616214171',13),(48,'审核通过','这是测试频道4下第5篇测试帖子的正文内容','2026-05-24 16:43:20.003874','测试频道4的帖子5','869086462',13),(49,'审核通过','这是测试频道4下第6篇测试帖子的正文内容','2026-05-24 16:43:20.012468','测试频道4的帖子6','800385698',13),(50,'审核通过','这是测试频道4下第7篇测试帖子的正文内容','2026-05-24 16:43:20.019273','测试频道4的帖子7','232031446',13),(51,'审核通过','这是测试频道4下第8篇测试帖子的正文内容','2026-05-24 16:43:20.028022','测试频道4的帖子8','857657658',13),(52,'审核通过','这是测试频道4下第9篇测试帖子的正文内容','2026-05-24 16:43:20.036448','测试频道4的帖子9','616214171',13),(53,'审核通过','这是测试频道4下第10篇测试帖子的正文内容','2026-05-24 16:43:20.042628','测试频道4的帖子10','869086462',13),(74,'审核通过','这是测试频道7下第1篇测试帖子的正文内容','2026-05-24 16:43:20.147363','测试频道7的帖子1','800385698',16),(75,'审核通过','这是测试频道7下第2篇测试帖子的正文内容','2026-05-24 16:43:20.151701','测试频道7的帖子2','232031446',16),(76,'审核通过','这是测试频道7下第3篇测试帖子的正文内容','2026-05-24 16:43:20.156328','测试频道7的帖子3','857657658',16),(77,'审核通过','这是测试频道7下第4篇测试帖子的正文内容','2026-05-24 16:43:20.160860','测试频道7的帖子4','616214171',16),(78,'审核通过','这是测试频道7下第5篇测试帖子的正文内容','2026-05-24 16:43:20.165148','测试频道7的帖子5','869086462',16),(79,'审核通过','这是测试频道7下第6篇测试帖子的正文内容','2026-05-24 16:43:20.169528','测试频道7的帖子6','800385698',16),(80,'审核通过','这是测试频道7下第7篇测试帖子的正文内容','2026-05-24 16:43:20.173738','测试频道7的帖子7','232031446',16),(81,'审核通过','这是测试频道7下第8篇测试帖子的正文内容','2026-05-24 16:43:20.178004','测试频道7的帖子8','857657658',16),(82,'审核通过','这是测试频道7下第9篇测试帖子的正文内容','2026-05-24 16:43:20.182173','测试频道7的帖子9','616214171',16),(83,'审核通过','这是测试频道7下第10篇测试帖子的正文内容','2026-05-24 16:43:20.186381','测试频道7的帖子10','869086462',16),(84,'审核通过','这是测试频道8下第1篇测试帖子的正文内容','2026-05-24 16:43:20.190582','测试频道8的帖子1','800385698',17),(85,'审核通过','这是测试频道8下第2篇测试帖子的正文内容','2026-05-24 16:43:20.194710','测试频道8的帖子2','232031446',17),(86,'审核通过','这是测试频道8下第3篇测试帖子的正文内容','2026-05-24 16:43:20.199046','测试频道8的帖子3','857657658',17),(87,'审核通过','这是测试频道8下第4篇测试帖子的正文内容','2026-05-24 16:43:20.203384','测试频道8的帖子4','616214171',17),(88,'审核通过','这是测试频道8下第5篇测试帖子的正文内容','2026-05-24 16:43:20.207601','测试频道8的帖子5','869086462',17),(89,'审核通过','这是测试频道8下第6篇测试帖子的正文内容','2026-05-24 16:43:20.211904','测试频道8的帖子6','800385698',17),(90,'审核通过','这是测试频道8下第7篇测试帖子的正文内容','2026-05-24 16:43:20.216259','测试频道8的帖子7','232031446',17),(91,'审核通过','这是测试频道8下第8篇测试帖子的正文内容','2026-05-24 16:43:20.220564','测试频道8的帖子8','857657658',17),(92,'审核通过','这是测试频道8下第9篇测试帖子的正文内容','2026-05-24 16:43:20.224703','测试频道8的帖子9','616214171',17),(93,'审核通过','这是测试频道8下第10篇测试帖子的正文内容','2026-05-24 16:43:20.229498','测试频道8的帖子10','869086462',17),(94,'审核通过','这是测试频道9下第1篇测试帖子的正文内容','2026-05-24 16:43:20.233971','测试频道9的帖子1','800385698',18),(95,'审核通过','这是测试频道9下第2篇测试帖子的正文内容','2026-05-24 16:43:20.238125','测试频道9的帖子2','232031446',18),(96,'审核通过','这是测试频道9下第3篇测试帖子的正文内容','2026-05-24 16:43:20.242468','测试频道9的帖子3','857657658',18),(97,'审核通过','这是测试频道9下第4篇测试帖子的正文内容','2026-05-24 16:43:20.251970','测试频道9的帖子4','616214171',18),(98,'审核通过','这是测试频道9下第5篇测试帖子的正文内容','2026-05-24 16:43:20.256188','测试频道9的帖子5','869086462',18),(99,'审核通过','这是测试频道9下第6篇测试帖子的正文内容','2026-05-24 16:43:20.260495','测试频道9的帖子6','800385698',18),(100,'审核通过','这是测试频道9下第7篇测试帖子的正文内容','2026-05-24 16:43:20.264688','测试频道9的帖子7','232031446',18),(101,'审核通过','这是测试频道9下第8篇测试帖子的正文内容','2026-05-24 16:43:20.268916','测试频道9的帖子8','857657658',18),(102,'审核通过','这是测试频道9下第9篇测试帖子的正文内容','2026-05-24 16:43:20.273096','测试频道9的帖子9','616214171',18),(103,'审核通过','这是测试频道9下第10篇测试帖子的正文内容','2026-05-24 16:43:20.285330','测试频道9的帖子10','869086462',18),(114,'审核通过','等你等得好苦啊！😊😍😘','2026-05-24 17:51:04.957306','正式版终于发布了！','437346159',9),(115,'审核通过','恶心心','2026-05-24 17:51:56.526329','叠词','437346159',8),(116,'审核通过','到底是谁运营的，老看到他用官号乱发帖，没人管吗🤣','2026-05-24 17:53:27.789648','不知道有没有人关注明日方舟官方号','437346159',3),(117,'审核通过','帖子发出去半天都没审核完🥲','2026-05-24 18:05:26.523064','这平台到底有没有审核啊','437346159',1),(119,'审核通过','这是测试用户在测试频道中发布的测试帖子','2026-02-12 08:00:00.000000','日期测试帖子','800385698',21),(120,'审核通过','今天下午1点10分记得去院楼403验收','2026-05-25 08:21:29.949013','验收','437346159',9),(121,'审核通过','这不是日期测试','2026-05-25 08:45:12.676157','不是测试','437346159',21),(122,'审核通过','123','2026-05-25 11:10:29.577830','123','997602667',1),(125,'审核通过','软工，轻而易举啊','2026-05-25 11:25:10.153335','核电，轻而易举','193721180',4),(126,'审核通过','+3','2026-05-25 12:53:37.796892','水贴','993063755',25),(127,'审核通过','1111','2026-05-25 12:59:15.201975','软工怎么验收，在线等急','246619214',25),(128,'审核未通过','完蛋了喵','2026-05-25 13:08:38.275761','完了喵','246619214',1),(129,'审核未通过','完蛋了喵','2026-05-25 13:08:50.408062','完蛋了','246619214',25),(130,'审核通过','完蛋了喵','2026-05-25 13:09:09.660946','完蛋喵','246619214',25),(132,'审核通过','111','2026-05-25 13:24:23.908445','111','139043378',1),(133,'审核通过','你好','2026-05-25 13:24:58.308275','你好','993063755',26);
/*!40000 ALTER TABLE `theme_post` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2026-05-25 10:48:59
